//
// Archivo: reducir.js
// Descripción: Implementa la función reducir(). Pruébala de forma automática con el anterior ejemplo.
// Fecha: 20/04/2024
// Nombre: Denys Litvynov
//

//--------------------------------------------
// Lista<T1> -> reducir() -> T2
//--------------------------------------------


//--------------------------------------------
//--------------------------------------------

// Prueba automática para la función 


//--------------------------------------------
// main()
//--------------------------------------------

const arr = [1,2,3,4,5];
const esper = 15;
probarReducir(arr, esper);

//--------------------------------------------
//--------------------------------------------
//--------------------------------------------