//
// Archivo: Pila.js
// Descripción:  Diseña, implementa y prueba un objeto pila (consultar Pila) con operaciones apilar(), desapilar() y cima().
// Fecha: 06/03/2024
// Nombre: Denys Litvynov
//

//
// 
//

//--------------------------------------------
//--------------------------------------------

// Prueba automática para la función 

//--------------------------------------------
// main()
//--------------------------------------------



//--------------------------------------------
//--------------------------------------------
//--------------------------------------------